#include <iostream>
using namespace std;
string R(int a, int b)
{
	string o, p, l = "Двадцать ";
	if (a == 1) o = "Первое";
	if (a == 2) o = "Второе";
	if (a == 3) o = "Третье";
	if (a == 4) o = "Четвертое";
	if (a == 5) o = "Пятое";
	if (a == 6) o = "Шестое";
	if (a == 7) o = "Седьмое";
	if (a == 8) o = "Восьмое";
	if (a == 9) o = "Девятое";
	if (a == 10) o = "Десятое";
	if (a == 11) o = "Одинадцатое";
	if (a == 12) o = "Двенадцатое";
	if (a == 13) o = "Тринадцатое";
	if (a == 14) o = "Четырнадцатое";
	if (a == 15) o = "Пятнаядцатое";
	if (a == 16) o = "Шестнадцатое";
	if (a == 17) o = "Семнадцатое";
	if (a == 18) o = "Восемнадцатое";
	if (a == 19) o = "Девятнадцатое";
	if (a == 20) o = "Двадцатое";
	if (a == 21) o = l + "первое";
	if (a == 22) o = l + "вторе";
	if (a == 23) o = l + "третье";
	if (a == 24) o = l + "четвертое";
	if (a == 25) o = l + "пятое";
	if (a == 26) o = l + "шестое";
	if (a == 27) o = l + "седьмое";
	if (a == 28) o = l + "восьмое";
	if (a == 29) o = l + "девятое";
	if (a == 30) o = "тридцатое";
	if (a == 31) o = "тридцать первое";
	if (b == 1) p = " января";
	if (b == 2) p = " февраля";
	if (b == 3) p = " марта";
	if (b == 4) p = " апреля";
	if (b == 5) p = " мая";
	if (b == 6) p = " июня";
	if (b == 7) p = " июля";
	if (b == 8) p = " августа";
	if (b == 9) p = " сентября";
	if (b == 10) p = " октября";
    if (b == 11) p = " ноября";
	if (b == 12) p = " декабря";
	string R = o + p;
	return R;
}
int main()
{
	setlocale(LC_ALL, "Russian");
	int a, b;
	cout << "Введите номер дня - целое число от 1 до 31: ";
	cin >> a;
	cout << "Введите номер месяца - целое число от 1 до 12: ";
	cin >> b;
	if ((a < 1) || (a > 31) || (b < 1) || (b > 12))
	{
		cout << "Как минимум одно из значений не удовлетворяет условию";
	}
	else
	{
		cout << R(a,b);
	}
	return 0;
}